In [1]:
import pandas as pd 
# dataframes - rows, columns, 2D

In [3]:
df= pd.DataFrame([[12,24,30],[41,53,60]])
df

    0   1   2
0  12  24  30
1  41  53  60

In [4]:
# dictionary

In [5]:
df=pd.DataFrame({'name':['Anurag','Arun','Ansh','Nikhil','Gautum','Ram'], 'rollno':[2,4,3,1,10,45],'class':['bba','mba','bba','btech','bca','mca']})
df

     name  rollno  class
0  Anurag       2    bba
1    Arun       4    mba
2    Ansh       3    bba
3  Nikhil       1  btech
4  Gautum      10    bca
5     Ram      45    mca

In [6]:
df.head() #first 5 bydefault

     name  rollno  class
0  Anurag       2    bba
1    Arun       4    mba
2    Ansh       3    bba
3  Nikhil       1  btech
4  Gautum      10    bca

In [9]:
df.head(2)

     name  rollno class
0  Anurag       2   bba
1    Arun       4   mba

In [11]:
df.tail()  # by default last 5
df.tail(3)

     name  rollno  class
3  Nikhil       1  btech
4  Gautum      10    bca
5     Ram      45    mca

In [12]:
# access 
# loc, iloc 
# [], .

In [13]:
df['name']

0    Anurag
1      Arun
2      Ansh
3    Nikhil
4    Gautum
5       Ram
Name: name, dtype: object

In [14]:
df['class']

0      bba
1      mba
2      bba
3    btech
4      bca
5      mca
Name: class, dtype: object

In [15]:
df['name'][4]

'Gautum'

In [16]:
df.name[4]

'Gautum'

In [19]:
df['class'][:3]

0    bba
1    mba
2    bba
Name: class, dtype: object

In [23]:
df[['name','class']][:3]

     name class
0  Anurag   bba
1    Arun   mba
2    Ansh   bba

In [24]:
df

     name  rollno  class
0  Anurag       2    bba
1    Arun       4    mba
2    Ansh       3    bba
3  Nikhil       1  btech
4  Gautum      10    bca
5     Ram      45    mca

In [25]:
# loc, iloc
df.loc[:,:]  # rows, columns

     name  rollno  class
0  Anurag       2    bba
1    Arun       4    mba
2    Ansh       3    bba
3  Nikhil       1  btech
4  Gautum      10    bca
5     Ram      45    mca

In [26]:
df.loc[:,'name']

0    Anurag
1      Arun
2      Ansh
3    Nikhil
4    Gautum
5       Ram
Name: name, dtype: object

In [28]:
df.loc[:,['name','class']]

     name  class
0  Anurag    bba
1    Arun    mba
2    Ansh    bba
3  Nikhil  btech
4  Gautum    bca
5     Ram    mca

In [31]:
df.loc[:3,['name']]

     name
0  Anurag
1    Arun
2    Ansh
3  Nikhil

In [35]:
# df.loc[1:,'name']

In [34]:
df.iloc[:3,:]

     name  rollno class
0  Anurag       2   bba
1    Arun       4   mba
2    Ansh       3   bba

In [37]:
df.iloc[:4,:2]

     name  rollno
0  Anurag       2
1    Arun       4
2    Ansh       3
3  Nikhil       1

In [40]:
df.loc[:,'totalmarks']=120
df

     name  rollno  class  totalmarks  marks
0  Anurag       2    bba         120     87
1    Arun       4    mba         120     56
2    Ansh       3    bba         120     77
3  Nikhil       1  btech         120     99
4  Gautum      10    bca         120     73
5     Ram      45    mca         120     67

In [41]:
df.loc[:,'marks']=[87,56,77,99,73,67]
df

     name  rollno  class  totalmarks  marks
0  Anurag       2    bba         120     87
1    Arun       4    mba         120     56
2    Ansh       3    bba         120     77
3  Nikhil       1  btech         120     99
4  Gautum      10    bca         120     73
5     Ram      45    mca         120     67

In [50]:
#delete 
# df.drop('totalmarks', axis=1, inplace=True)

In [48]:
df

     name  rollno  class  marks
0  Anurag       2    bba     87
1    Arun       4    mba     56
2    Ansh       3    bba     77
3  Nikhil       1  btech     99
4  Gautum      10    bca     73
5     Ram      45    mca     67

In [52]:
df[df.loc[:,'class']=='bba']

     name  rollno class  marks
0  Anurag       2   bba     87
2    Ansh       3   bba     77

In [55]:
df[(df.loc[:,'class']=='bba') | (df.loc[:,'marks']>80)]

     name  rollno  class  marks
0  Anurag       2    bba     87
2    Ansh       3    bba     77
3  Nikhil       1  btech     99

In [56]:
# null values, duplicates find, nullvalues drop, fill, insert, rename